# Задача 1 (просто) "Арифметика":
#
#     Напишите в начале программы однострочный комментарий: "1st program".
#     Выведите на экран(в консоль) результат: возведение числа 9 в степень 0.5, после умножение на 5.
#     Предполагаемый результат: 15.0
print('1st program')
print(9**0.5 * 5)


# Задача 2 (просто) "Логика":
#
#     Напишите в начале программы однострочный комментарий: "2nd program".
#     Убедитесь в том что 9.99 больше 9.98 и 1000 не равно 1000.1 одновременно, выведете результат на экран(в консоль)
#      Предполагаемый результат: True
print('2st program')
print(9.99 > 9.98 and 1000 != 1000.1)

# Задача 3 (средне) "Школьная загадка":
#
#     Напишите в начале программы однострочный комментарий: "3rd program".
#     Выведите на экран(в консоль) 2 умноженное на 2 плюс 2 без приоритета.
#     Выведите на экран(в консоль) 2 умноженное на 2 плюс 2 с приоритетом для сложения.
#     Выведите на экран(в консоль) результат сравнения этих двух выражений.
#     Предполагаемый результат (с использованием ==): False
print('3st program')
a = 2 * 2 + 2
print(a)
b = 2 * (2 + 2)
print(b)
print(a == b)
# Задача 4 (сложно) "Первый после точки":
#
#     Напишите в начале программы однострочный комментарий: "4th program".
#     Дана строка '123.456'.
#     Вывести на экран первую цифру после запятой - 4.
print('4th program')
a = '123.456'
print(a.split('.')[1][0])
# Начало алгоритма решения:
#
#     Преобразуйте в строку в дробное число. ('123.456' -> 123.456)
#     Умножьте на 10, чтобы сместить 4 в целую часть. (1234.56)
a = float('123.456') * 10
print(a)
# Следующие шаги алгоритма составьте самостоятельно. В них вам понадобится команда int() и остаточное деление на 10.

b = '56789'
c = int((int(b) / a) % 10)
print(c)